Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CircleProfile Class
 The IFC2X3_ParametricObject_CircleProfile class contains the circular profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_CircleProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_CircleProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_CircleProfile type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
Radius
 The radius.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace